name: "RED-Net"
layer {
  name: "forward_flow"
  type: "DummyData"
  top: "forward_flow"
  dummy_data_param {
    shape {
      dim: 1
      dim: 2
      dim: 200
      dim: 200
    }
  }
}

layer {
  name: "srcImg"
  type: "DummyData"
  top: "srcImg"
  dummy_data_param {
    shape {
      dim: 1
      dim: 3
      dim: 200
      dim: 200
    }
  }
}

layer {
  name: "tgtImg"
  type: "DummyData"
  top: "tgtImg"
  dummy_data_param {
    shape {
      dim: 1
      dim: 3
      dim: 200
      dim: 200
    }
  }
}

layer {
  name: "gt_xyz"
  type: "DummyData"
  top: "gt_xyz"
  dummy_data_param {
    shape {
      dim: 1
      dim: 3
      dim: 200
      dim: 200
    }
  }
}

layer {
  name: "tform"
  type: "DummyData"
  top: "tform"
  dummy_data_param {
    shape {
      dim: 1
    }
  }
}

layer {
  name: "tgtMask"
  type: "DummyData"
  top: "tgtMask"
  dummy_data_param {
    shape {
      dim: 1
      dim: 1
      dim: 200
      dim: 200
    }
  }
}


layer {
  name: "forward_backward_remap"
  type: "Python"
  bottom: "forward_flow"
  bottom: "gt_xyz"
  bottom: "tform"
  top: "remaped_forward_flow"
  python_param {
    module: "forward_backward_map_layer"
    layer: "forward_backward_map_layer"
  }
}


# conv6
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "remaped_forward_flow"
  top: "c6"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu6"  type: "ReLU"  bottom: "c6"  top: "c6" }

# conv7
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "c6"
  top: "c7"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu7"  type: "ReLU"  bottom: "c7"  top: "c7" }

# conv8
layer {
  name: "conv8"
  type: "Convolution"
  bottom: "c7"
  top: "c8"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu8"  type: "ReLU"  bottom: "c8"  top: "c8" }

# conv9
layer {
  name: "conv9"
  type: "Convolution"
  bottom: "c8"
  top: "c9"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu9"  type: "ReLU"  bottom: "c9"  top: "c9" }

# conv10
layer {
  name: "conv10"
  type: "Convolution"
  bottom: "c9"
  top: "c10"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu10"  type: "ReLU"  bottom: "c10"  top: "c10" }

# conv11
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "c10"
  top: "c11"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu11"  type: "ReLU"  bottom: "c11"  top: "c11" }

# conv12
layer {
  name: "conv12"
  type: "Convolution"
  bottom: "c11"
  top: "c12"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu12"  type: "ReLU"  bottom: "c12"  top: "c12" }

# conv13
layer {
  name: "conv13"
  type: "Convolution"
  bottom: "c12"
  top: "c13"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu13"  type: "ReLU"  bottom: "c13"  top: "c13" }

# conv14
layer {
  name: "conv14"
  type: "Convolution"
  bottom: "c13"
  top: "c14"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu14"  type: "ReLU"  bottom: "c14"  top: "c14" }

# conv15
layer {
  name: "conv15"
  type: "Convolution"
  bottom: "c14"
  top: "c15"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu15"  type: "ReLU"  bottom: "c15"  top: "c15" }

# deconv1
layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "c15"
  top: "d1"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu16"  type: "ReLU"  bottom: "d1"  top: "d1" }

# residual1
layer {
  name: "residual1"
  type: "Eltwise"
  bottom: "c14"
  bottom: "d1"
  top: "d1a"
}
layer {  name: "relu17"  type: "ReLU"  bottom: "d1a"  top: "d1a" }

# deconv2
layer {
  name: "deconv2"
  type: "Deconvolution"
  bottom: "d1a"
  top: "d2"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu18"  type: "ReLU"  bottom: "d2"  top: "d2" }

# deconv3
layer {
  name: "deconv3"
  type: "Deconvolution"
  bottom: "d2"
  top: "d3"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu19"  type: "ReLU"  bottom: "d3"  top: "d3" }

# residual2
layer {
  name: "residual2"
  type: "Eltwise"
  bottom: "c12"
  bottom: "d3"
  top: "d3a"
}
layer {  name: "relu20"  type: "ReLU"  bottom: "d3a"  top: "d3a" }

# deconv4
layer {
  name: "deconv4"
  type: "Deconvolution"
  bottom: "d3a"
  top: "d4"
  convolution_param { weight_filler { type: "xavier" } num_output:   128   kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu21"  type: "ReLU"  bottom: "d4"  top: "d4" }

# deconv5
layer {
  name: "deconv5"
  type: "Deconvolution"
  bottom: "d4"
  top: "d5"
  convolution_param { weight_filler { type: "xavier" } num_output:   128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu22"  type: "ReLU"  bottom: "d5"  top: "d5" }

# residual3
layer {
  name: "residual3"
  type: "Eltwise"
  bottom: "c10"
  bottom: "d5"
  top: "d5a"
}
layer {  name: "relu23"  type: "ReLU"  bottom: "d5a"  top: "d5a" }


# deconv6
layer {
  name: "deconv6"
  type: "Deconvolution"
  bottom: "d5a"
  top: "d6"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu24"  type: "ReLU"  bottom: "d6"  top: "d6" }


# deconv7
layer {
  name: "deconv7"
  type: "Deconvolution"
  bottom: "d6"
  top: "d7"
  convolution_param { weight_filler { type: "xavier" } num_output:  128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu25"  type: "ReLU"  bottom: "d7"  top: "d7" }

# residual4
layer {
  name: "residual4"
  type: "Eltwise"
  bottom: "c8"
  bottom: "d7"
  top: "d7a"
}
layer {  name: "relu26"  type: "ReLU"  bottom: "d7a"  top: "d7a" }

# deconv8
layer {
  name: "deconv8"
  type: "Deconvolution"
  bottom: "d7a"
  top: "d8"
  convolution_param { weight_filler { type: "xavier" } num_output:   128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu27"  type: "ReLU"  bottom: "d8"  top: "d8" }

# deconv9
layer {
  name: "deconv9"
  type: "Deconvolution"
  bottom: "d8"
  top: "d9"
  convolution_param { weight_filler { type: "xavier" } num_output:   128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu28"  type: "ReLU"  bottom: "d9"  top: "d9" }

# residual5
layer {
  name: "residual5"
  type: "Eltwise"
  bottom: "c6"
  bottom: "d9"
  top: "d9a"
}
layer {  name: "relu29"  type: "ReLU"  bottom: "d9a"  top: "d9a" }

# deconv10
layer {
  name: "deconv10"
  type: "Deconvolution"
  bottom: "d9a"
  top: "d10"
  convolution_param { weight_filler { type: "xavier" } num_output:   128    kernel_size: 3    stride: 1    pad: 1 }
}
layer {  name: "relu30"  type: "ReLU"  bottom: "d10"  top: "d10" }

# deconv11
layer {
  name: "deconv11"
  type: "Deconvolution"
  bottom: "d10"
  top: "d11"
  convolution_param { weight_filler { type: "xavier" } num_output:   2    kernel_size: 3    stride: 1    pad: 1 }
}




layer {
  name: "gxy"
  type: "Python"
  top: "gxy"
  python_param {
    module: "meshgrid_layer"
    layer: "meshgrid_layer"
    param_str: "{\'height\': 200, \'batch_size\': 1, \'width\': 200}"
  }
}

layer {
  name: "coords"
  type: "Eltwise"
  bottom: "d11"
  bottom: "gxy"
  top: "coords"
  eltwise_param {
    coeff: 1
    coeff: 1
  }
}
layer {
  name: "predImg"
  type: "Remap"
  bottom: "srcImg"
  bottom: "coords"
  top: "predImg"
}

layer {
  name: "imgLoss"
  type: "Python"
  bottom: "predImg"
  bottom: "tgtImg"
  top: "imgLoss"
  python_param {
    module: "FN_maskedL1_layer_2"
    layer: "FN_maskedL1_layer_2"
    param_str: "{\'loss_weight\': 0.00000001}"
  }
  loss_weight: 1
}










