name: "RED-Net"
layer {
  name: "forward_flow"
  type: "DummyData"
  top: "forward_flow"
  dummy_data_param {
    shape {
      dim: 1
      dim: 2
      dim: 200
      dim: 200
    }
  }
}



layer {
  name: "gt_xyz"
  type: "DummyData"
  top: "gt_xyz"
  dummy_data_param {
    shape {
      dim: 1
      dim: 3
      dim: 200
      dim: 200
    }
  }
}

layer {
  name: "tform"
  type: "DummyData"
  top: "tform"
  dummy_data_param {
    shape {
      dim: 1
    }
  }
}




layer {
  name: "forward_backward_remap"
  type: "Python"
  bottom: "forward_flow"
  bottom: "gt_xyz"
  bottom: "tform"
  top: "remaped_forward_flow"
  python_param {
    module: "forward_backward_map_layer"
    layer: "forward_backward_map_layer"
  }
}










